UTAF_Base/requestFiles/BPS_Exclusivity_CheckExclusivity.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:v4.context.vss.objects.bgc" xmlns:urn1="urn:v1.exclusivityservice.bps.services.bgc" xmlns:urn2="urn:v1.bpsmodel.bps.objects.bgc">
   <soapenv:Header>
      <urn:Context version="4.0">
         <urn:correlationId>${Req_corrId}</urn:correlationId>
         <urn:consumerApplicationId>TST</urn:consumerApplicationId>
         
         <urn:endUserId>id058127</urn:endUserId>
         
         <urn:endUserLanguage>EN</urn:endUserLanguage>
         
         <urn:propagatedKey>${Req_propagatedKey}</urn:propagatedKey>
      </urn:Context>
   </soapenv:Header>
   <soapenv:Body>
      <urn1:RequestDataCheckExclusivity version="1.0">
         
         <urn1:userContext>
            <urn2:applicationNm>TST</urn2:applicationNm>
            <urn2:correlationId>${Req_corrId}</urn2:correlationId>
            <urn2:userId>id058127</urn2:userId>
            <urn2:languageIso2Code>EN</urn2:languageIso2Code>
         </urn1:userContext>
         <urn1:checkTypeCd>${Req_checkTypeCd}</urn1:checkTypeCd>
         
         <urn1:planId>${Req_planId}</urn1:planId>
         
         <urn1:planType>${Req_planType}</urn1:planType>
         
         <urn1:custId>${Req_custId}</urn1:custId>
         
         <urn1:accId>${Req_accId}</urn1:accId>
         
         <urn1:subscriptionNbr>${Req_subscriptionNbr}</urn1:subscriptionNbr>
         
         <urn1:networkType>${Req_networkType}</urn1:networkType>
         
         <urn1:lineGroupId>${Req_lineGroupId}</urn1:lineGroupId>
         
         <urn1:ptyGroupId>${Req_ptyGroupId}</urn1:ptyGroupId>
         
         <urn1:packReferenceId>${Req_packReferenceId}</urn1:packReferenceId>
         
         <urn1:mbrPtyGroupId>${Req_mbrPtyGroupId}</urn1:mbrPtyGroupId>
         
         <urn1:startDate>${Req_startDate}</urn1:startDate>
         
         <urn1:endDate>${Req_endDate}</urn1:endDate>
         
         <urn1:categoryCd>${Req_categoryCd}</urn1:categoryCd>
         
         <urn1:liteCheck>${Req_liteCheck}</urn1:liteCheck>
         
         <urn1:continueBilling>${Req_continueBilling}</urn1:continueBilling>
         
         <urn1:custId2>${Req_custId2}</urn1:custId2>
         
         <urn1:accId2>${Req_accId2}</urn1:accId2>
      </urn1:RequestDataCheckExclusivity>
   </soapenv:Body>
</soapenv:Envelope>
